witalis3/UA3REO-DDC-Transceiver/STM32/Src/audio_filters.c
arm_biquad_cascade_df2T_instance_f32 DECIMATE_IIR_RX2_AUDIO_I =
	{
		.numStages = IIR_DECIMATOR_FILTER_STAGES,
		.pState = (float32_t[IIR_DECIMATOR_FILTER_STAGES * 2]){0},
		.pCoeffs = DECIMATE_IIR_Coeffs,
};
arm_biquad_cascade_df2T_instance_f32 DECIMATE_IIR_RX2_AUDIO_Q =
	{
		.numStages = IIR_DECIMATOR_FILTER_STAGES,
		.pState = (float32_t[IIR_DECIMATOR_FILTER_STAGES * 2]){0},
		.pCoeffs = DECIMATE_IIR_Coeffs,
};

//CTCSS Frequencies
float32_t CTCSS_Freqs[CTCSS_FREQS_COUNT] = {0.0,33.0,35.4,36.6,37.9,39.6,44.4,47.5,49.2,51.2,53.0,54.9,56.8,58.8,63.0,67.0,69.3,71.9,74.4,77.0,79.7,82.5,85.4,88.5,91.5,94.8,97.4,100.0,103.5,107.2,110.9,114.8,118.8,123.0,127.3,131.8,136.5,141.3,146.2,150.0,151.4,156.7,159.8,162.2,165.5,167.9,171.3,173.8,177.3,179.9,183.5,186.2,189.9,192.8,196.6,199.5,203.5,206.5,210.7,218.1,225.7,229.1,233.6,241.8,250.3,254.1};

//Public variables
const uint32_t AUTIO_FILTERS_HPF_LIST[CW_HPF_COUNT] = {0, 60, 100, 200, 300, 400, 500, 600};
const uint32_t AUTIO_FILTERS_LPF_CW_LIST[CW_LPF_COUNT] = {50, 100, 150, 200, 250, 300, 350, 400, 450, 500, 550, 600, 650, 700, 750, 800, 850, 900, 950, 1000};
const uint32_t AUTIO_FILTERS_LPF_SSB_LIST[SSB_LPF_COUNT] = {1400, 1600, 1800, 2100, 2300, 2500, 2700, 2900, 3000, 3200, 3400};
const uint32_t AUTIO_FILTERS_LPF_AM_LIST[AM_LPF_COUNT] = {2100, 2300, 2500, 2700, 2900, 3000, 3200, 3400, 3600, 3800, 4000, 4500, 5000, 6000, 7000, 8000, 9000, 10000, 15000, 20000};
const uint32_t AUTIO_FILTERS_LPF_NFM_LIST[NFM_LPF_COUNT] = {5000, 6000, 7000, 8000, 9000, 10000, 12000, 15000, 20000, 24000, 30000, 44000};

arm_fir_instance_f32 FIR_RX1_Hilbert_I; // filter instances
arm_fir_instance_f32 FIR_RX1_Hilbert_Q;
arm_fir_instance_f32 FIR_RX2_Hilbert_I;
arm_fir_instance_f32 FIR_RX2_Hilbert_Q;
arm_fir_instance_f32 FIR_TX_Hilbert_I;
arm_fir_instance_f32 FIR_TX_Hilbert_Q;
arm_biquad_cascade_df2T_instance_f32 IIR_RX1_LPF_I;
arm_biquad_cascade_df2T_instance_f32 IIR_RX1_LPF_Q;
arm_biquad_cascade_df2T_instance_f32 IIR_RX1_LPF2_I;
arm_biquad_cascade_df2T_instance_f32 IIR_RX1_LPF2_Q;
arm_biquad_cascade_df2T_instance_f32 IIR_RX1_GAUSS_I;
arm_biquad_cascade_df2T_instance_f32 IIR_RX1_GAUSS_Q;
arm_biquad_cascade_df2T_instance_f32 IIR_RX2_LPF_I;
arm_biquad_cascade_df2T_instance_f32 IIR_RX2_LPF_Q;
arm_biquad_cascade_df2T_instance_f32 IIR_RX2_LPF2_I;
arm_biquad_cascade_df2T_instance_f32 IIR_RX2_LPF2_Q;
arm_biquad_cascade_df2T_instance_f32 IIR_RX2_GAUSS_I;
arm_biquad_cascade_df2T_instance_f32 IIR_RX2_GAUSS_Q;
arm_biquad_cascade_df2T_instance_f32 IIR_TX_LPF_I;
arm_biquad_cascade_df2T_instance_f32 IIR_RX1_HPF_I;
arm_biquad_cascade_df2T_instance_f32 IIR_RX2_HPF_I;
arm_biquad_cascade_df2T_instance_f32 IIR_TX_HPF_I;
arm_biquad_cascade_df2T_instance_f32 IIR_RX1_Squelch_HPF;
arm_biquad_cascade_df2T_instance_f32 IIR_RX2_Squelch_HPF;
arm_biquad_cascade_df2T_instance_f32 NOTCH_RX1_FILTER = {NOTCH_STAGES, NOTCH_RX1_State, NOTCH_RX1_Coeffs}; // manual notch filter
arm_biquad_cascade_df2T_instance_f32 NOTCH_RX2_FILTER = {NOTCH_STAGES, NOTCH_RX2_State, NOTCH_RX2_Coeffs};
arm_biquad_cascade_df2T_instance_f32 EQ_RX_I_LOW_FILTER = {EQ_STAGES, EQ_RX_I_LOW_FILTER_State, EQ_RX_LOW_FILTER_Coeffs};
arm_biquad_cascade_df2T_instance_f32 EQ_RX_I_MID_FILTER = {EQ_STAGES, EQ_RX_I_MID_FILTER_State, EQ_RX_MID_FILTER_Coeffs};
arm_biquad_cascade_df2T_instance_f32 EQ_RX_I_HIG_FILTER = {EQ_STAGES, EQ_RX_I_HIG_FILTER_State, EQ_RX_HIG_FILTER_Coeffs};
arm_biquad_cascade_df2T_instance_f32 EQ_RX_Q_LOW_FILTER = {EQ_STAGES, EQ_RX_Q_LOW_FILTER_State, EQ_RX_LOW_FILTER_Coeffs};
arm_biquad_cascade_df2T_instance_f32 EQ_RX_Q_MID_FILTER = {EQ_STAGES, EQ_RX_Q_MID_FILTER_State, EQ_RX_MID_FILTER_Coeffs};
arm_biquad_cascade_df2T_instance_f32 EQ_RX_Q_HIG_FILTER = {EQ_STAGES, EQ_RX_Q_HIG_FILTER_State, EQ_RX_HIG_FILTER_Coeffs};
arm_biquad_cascade_df2T_instance_f32 EQ_MIC_LOW_FILTER_SSB = {EQ_STAGES, EQ_MIC_LOW_FILTER_State_SSB, EQ_MIC_LOW_FILTER_Coeffs_SSB};
arm_biquad_cascade_df2T_instance_f32 EQ_MIC_MID_FILTER_SSB = {EQ_STAGES, EQ_MIC_MID_FILTER_State_SSB, EQ_MIC_MID_FILTER_Coeffs_SSB};
arm_biquad_cascade_df2T_instance_f32 EQ_MIC_HIG_FILTER_SSB = {EQ_STAGES, EQ_MIC_HIG_FILTER_State_SSB, EQ_MIC_HIG_FILTER_Coeffs_SSB};
arm_biquad_cascade_df2T_instance_f32 EQ_MIC_LOW_FILTER_AMFM = {EQ_STAGES, EQ_MIC_LOW_FILTER_State_AMFM, EQ_MIC_LOW_FILTER_Coeffs_AMFM};
arm_biquad_cascade_df2T_instance_f32 EQ_MIC_MID_FILTER_AMFM = {EQ_STAGES, EQ_MIC_MID_FILTER_State_AMFM, EQ_MIC_MID_FILTER_Coeffs_AMFM};
arm_biquad_cascade_df2T_instance_f32 EQ_MIC_HIG_FILTER_AMFM = {EQ_STAGES, EQ_MIC_HIG_FILTER_State_AMFM, EQ_MIC_HIG_FILTER_Coeffs_AMFM};
arm_biquad_cascade_df2T_instance_f32 AGC_RX1_KW_HSHELF_FILTER = {EQ_STAGES, AGC_RX1_KW_HSHELF_FILTER_State, AGC_RX_KW_HSHELF_FILTER_Coeffs};
arm_biquad_cascade_df2T_instance_f32 AGC_RX1_KW_HPASS_FILTER = {EQ_STAGES, AGC_RX1_KW_HPASS_FILTER_State, AGC_RX_KW_HPASS_FILTER_Coeffs};
arm_biquad_cascade_df2T_instance_f32 AGC_RX2_KW_HSHELF_FILTER = {EQ_STAGES, AGC_RX2_KW_HSHELF_FILTER_State, AGC_RX_KW_HSHELF_FILTER_Coeffs};
arm_biquad_cascade_df2T_instance_f32 AGC_RX2_KW_HPASS_FILTER = {EQ_STAGES, AGC_RX2_KW_HPASS_FILTER_State, AGC_RX_KW_HPASS_FILTER_Coeffs};
volatile bool NeedReinitNotch = false;			   // need to re-initialize the manual Notch filter
volatile bool NeedReinitAudioFilters = false;	   // need to re-initialize Audio filters
volatile bool NeedReinitAudioFiltersClean = false; //also clean state

// Prototypes
static void calcBiquad(BIQUAD_TYPE type, uint32_t Fc, uint32_t Fs, float32_t Q, float32_t peakGain, float32_t *outCoeffs);									  // automatic calculation of the Biquad filter for Notch
static void arm_biquad_cascade_df2T_initNoClean_f32(arm_biquad_cascade_df2T_instance_f32 *S, uint8_t numStages, const float32_t *pCoeffs, float32_t *pState); //init without state-clean version

// initialize audio filters
void InitAudioFilters(void)
{
	//TX Hilbert
	arm_fir_init_f32(&FIR_TX_Hilbert_I, IQ_HILBERT_TAPS, (float32_t *)&FIR_HILB_I_coeffs, (float32_t *)&Fir_Tx_Hilbert_State_I[0], AUDIO_BUFFER_HALF_SIZE);
	arm_fir_init_f32(&FIR_TX_Hilbert_Q, IQ_HILBERT_TAPS, (float32_t *)&FIR_HILB_Q_coeffs, (float32_t *)&Fir_Tx_Hilbert_State_Q[0], AUDIO_BUFFER_HALF_SIZE);

	//AGC K-Weight LKFS BS.1770
	calcBiquad(BIQUAD_highShelf, 1500, TRX_SAMPLERATE, 1.0f / sqrtf(2), 4.0f, AGC_RX_KW_HSHELF_FILTER_Coeffs);
	calcBiquad(BIQUAD_highpass, 38, TRX_SAMPLERATE, 0.5f, 0.0f, AGC_RX_KW_HPASS_FILTER_Coeffs);

	//Other
	InitNoiseReduction();
	InitNotchFilter();
	InitAutoNotchReduction();
	InitVAD();
	ReinitAudioFilters();
}

