witalis3/UA3REO-DDC-Transceiver/STM32/Src/audio_filters.c
// reinitialize audio filters
void ReinitAudioFilters(void)
{
	//RX1 Hilbert
	if (CurrentVFO->Mode == TRX_MODE_CW)
	{
		arm_fir_init_f32(&FIR_RX1_Hilbert_I, IQ_HILBERT_TAPS, (float32_t *)&FIR_HILB_I_coeffs, (float32_t *)&Fir_RX1_Hilbert_State_I[0], AUDIO_BUFFER_HALF_SIZE);
		arm_fir_init_f32(&FIR_RX1_Hilbert_Q, IQ_HILBERT_TAPS, (float32_t *)&FIR_HILB_Q_coeffs, (float32_t *)&Fir_RX1_Hilbert_State_Q[0], AUDIO_BUFFER_HALF_SIZE);
	}
	else
	{
		arm_fir_init_f32(&FIR_RX1_Hilbert_I, IQ_HILBERT_TAPS, (float32_t *)&FIR_HILB_I_coeffs, (float32_t *)&Fir_RX1_Hilbert_State_I[0], AUDIO_BUFFER_HALF_SIZE);
		arm_fir_init_f32(&FIR_RX1_Hilbert_Q, IQ_HILBERT_TAPS, (float32_t *)&FIR_HILB_Q_coeffs, (float32_t *)&Fir_RX1_Hilbert_State_Q[0], AUDIO_BUFFER_HALF_SIZE);
	}

	//RX2 Hilbert
	if (SecondaryVFO->Mode == TRX_MODE_CW)
	{
		arm_fir_init_f32(&FIR_RX2_Hilbert_I, IQ_HILBERT_TAPS, (float32_t *)&FIR_HILB_I_coeffs, (float32_t *)&Fir_RX2_Hilbert_State_I[0], AUDIO_BUFFER_HALF_SIZE);
		arm_fir_init_f32(&FIR_RX2_Hilbert_Q, IQ_HILBERT_TAPS, (float32_t *)&FIR_HILB_Q_coeffs, (float32_t *)&Fir_RX2_Hilbert_State_Q[0], AUDIO_BUFFER_HALF_SIZE);
	}
	else
	{
		arm_fir_init_f32(&FIR_RX2_Hilbert_I, IQ_HILBERT_TAPS, (float32_t *)&FIR_HILB_I_coeffs, (float32_t *)&Fir_RX2_Hilbert_State_I[0], AUDIO_BUFFER_HALF_SIZE);
		arm_fir_init_f32(&FIR_RX2_Hilbert_Q, IQ_HILBERT_TAPS, (float32_t *)&FIR_HILB_Q_coeffs, (float32_t *)&Fir_RX2_Hilbert_State_Q[0], AUDIO_BUFFER_HALF_SIZE);
	}

	//parameters
	uint32_t hpf_rx1_width = 300; //default settings
	if (CurrentVFO->HPF_Filter_Width > 0)
		hpf_rx1_width = CurrentVFO->HPF_Filter_Width;
	//
	uint32_t hpf_rx2_width = 300; //default settings
	if (SecondaryVFO->HPF_Filter_Width > 0)
		hpf_rx2_width = SecondaryVFO->HPF_Filter_Width;
	//
	uint32_t lpf_rx1_width = 2700; //default settings
	if (CurrentVFO->LPF_RX_Filter_Width > 0)
		lpf_rx1_width = CurrentVFO->LPF_RX_Filter_Width;
	if(lpf_rx1_width < hpf_rx1_width && CurrentVFO->HPF_Filter_Width > 0)
			lpf_rx1_width = hpf_rx1_width + 100;
	if (CurrentVFO->Mode == TRX_MODE_NFM || CurrentVFO->Mode == TRX_MODE_AM || CurrentVFO->Mode == TRX_MODE_SAM || CurrentVFO->Mode == TRX_MODE_CW)
		lpf_rx1_width /= 2;
	//
	uint32_t lpf_rx2_width = 2700; //default settings
	if (SecondaryVFO->LPF_RX_Filter_Width > 0)
		lpf_rx2_width = SecondaryVFO->LPF_RX_Filter_Width;
	if(lpf_rx2_width < hpf_rx2_width && SecondaryVFO->HPF_Filter_Width > 0)
			lpf_rx2_width = hpf_rx2_width + 100;
	if (CurrentVFO->Mode == TRX_MODE_NFM || CurrentVFO->Mode == TRX_MODE_AM || CurrentVFO->Mode == TRX_MODE_SAM || CurrentVFO->Mode == TRX_MODE_CW)
		lpf_rx2_width /= 2;
	//
	uint32_t lpf_tx_width = 2700; //default settings
	if (CurrentVFO->LPF_TX_Filter_Width > 0)
		lpf_tx_width = CurrentVFO->LPF_TX_Filter_Width;
	if(lpf_tx_width < hpf_rx1_width)
		lpf_tx_width = hpf_rx1_width + 100;
	if (CurrentVFO->Mode == TRX_MODE_NFM || CurrentVFO->Mode == TRX_MODE_AM || CurrentVFO->Mode == TRX_MODE_SAM || CurrentVFO->Mode == TRX_MODE_CW)
		lpf_tx_width /= 2;
	//
	
	//Decimator filters
	uint32_t decim_iir_filter_stages = IIR_DECIMATOR_FILTER_STAGES;
	uint32_t decim_iir_filter_width = 20000;
	if(lpf_rx1_width < 5000 && (!TRX.Dual_RX || lpf_rx2_width < 5000))
		decim_iir_filter_width = 5000;
	if(TRX_GetRXSampleRate > 192000)
		decim_iir_filter_stages = 5;
	iir_filter_t *filter = biquad_create(decim_iir_filter_stages);
	biquad_init_lowpass(filter, TRX_GetRXSampleRate, 20000);
	fill_biquad_coeffs(filter, DECIMATE_IIR_Coeffs, decim_iir_filter_stages);
	uint32_t need_decimate_rate = TRX_GetRXSampleRate / TRX_SAMPLERATE;
	DECIMATE_FIR_RX1_AUDIO_I.M = need_decimate_rate;
	DECIMATE_FIR_RX1_AUDIO_Q.M = need_decimate_rate;
	DECIMATE_FIR_RX2_AUDIO_I.M = need_decimate_rate;
	DECIMATE_FIR_RX2_AUDIO_Q.M = need_decimate_rate;
	DECIMATE_IIR_RX1_AUDIO_I.numStages = decim_iir_filter_stages;
	
	//LPF RX1
	filter = biquad_create(IIR_LPF_STAGES);
	biquad_init_lowpass(filter, TRX_SAMPLERATE, lpf_rx1_width);
	fill_biquad_coeffs(filter, IIR_RX1_LPF_Coeffs, IIR_LPF_STAGES);
	arm_biquad_cascade_df2T_initNoClean_f32(&IIR_RX1_LPF_I, IIR_LPF_STAGES, IIR_RX1_LPF_Coeffs, (float32_t *)&IIR_RX1_LPF_I_State[0]);
	arm_biquad_cascade_df2T_initNoClean_f32(&IIR_RX1_LPF_Q, IIR_LPF_STAGES, IIR_RX1_LPF_Coeffs, (float32_t *)&IIR_RX1_LPF_Q_State[0]);
	arm_biquad_cascade_df2T_initNoClean_f32(&IIR_RX1_LPF2_I, IIR_LPF_STAGES, IIR_RX1_LPF_Coeffs, (float32_t *)&IIR_RX1_LPF2_I_State[0]);
	arm_biquad_cascade_df2T_initNoClean_f32(&IIR_RX1_LPF2_Q, IIR_LPF_STAGES, IIR_RX1_LPF_Coeffs, (float32_t *)&IIR_RX1_LPF2_Q_State[0]);
	
	//LPF TX
	biquad_init_lowpass(filter, TRX_SAMPLERATE, lpf_tx_width);
	fill_biquad_coeffs(filter, IIR_TX_LPF_Coeffs, IIR_LPF_STAGES);
	arm_biquad_cascade_df2T_initNoClean_f32(&IIR_TX_LPF_I, IIR_LPF_STAGES, IIR_TX_LPF_Coeffs, (float32_t *)&IIR_TX_LPF_I_State[0]);
	
	//LPF RX2
	biquad_init_lowpass(filter, TRX_SAMPLERATE, lpf_rx2_width);
	fill_biquad_coeffs(filter, IIR_RX2_LPF_Coeffs, IIR_LPF_STAGES);
	arm_biquad_cascade_df2T_initNoClean_f32(&IIR_RX2_LPF_I, IIR_LPF_STAGES, IIR_RX2_LPF_Coeffs, (float32_t *)&IIR_RX2_LPF_I_State[0]);
	arm_biquad_cascade_df2T_initNoClean_f32(&IIR_RX2_LPF_Q, IIR_LPF_STAGES, IIR_RX2_LPF_Coeffs, (float32_t *)&IIR_RX2_LPF_Q_State[0]);
	arm_biquad_cascade_df2T_initNoClean_f32(&IIR_RX2_LPF2_I, IIR_LPF_STAGES, IIR_RX2_LPF_Coeffs, (float32_t *)&IIR_RX2_LPF2_I_State[0]);
	arm_biquad_cascade_df2T_initNoClean_f32(&IIR_RX2_LPF2_Q, IIR_LPF_STAGES, IIR_RX2_LPF_Coeffs, (float32_t *)&IIR_RX2_LPF2_Q_State[0]);

	//HPF
	filter = biquad_create(IIR_HPF_STAGES);
	biquad_init_highpass(filter, TRX_SAMPLERATE, hpf_rx1_width);
	fill_biquad_coeffs(filter, IIR_RX1_HPF_Coeffs, IIR_HPF_STAGES);
	arm_biquad_cascade_df2T_initNoClean_f32(&IIR_RX1_HPF_I, IIR_HPF_STAGES, IIR_RX1_HPF_Coeffs, (float32_t *)&IIR_RX1_HPF_I_State[0]);
	arm_biquad_cascade_df2T_initNoClean_f32(&IIR_TX_HPF_I, IIR_HPF_STAGES, IIR_RX1_HPF_Coeffs, (float32_t *)&IIR_TX_HPF_I_State[0]);

	biquad_init_highpass(filter, TRX_SAMPLERATE, hpf_rx2_width);
	fill_biquad_coeffs(filter, IIR_RX2_HPF_Coeffs, IIR_HPF_STAGES);
	arm_biquad_cascade_df2T_initNoClean_f32(&IIR_RX2_HPF_I, IIR_HPF_STAGES, IIR_RX2_HPF_Coeffs, (float32_t *)&IIR_RX2_HPF_I_State[0]);

